benchmarks/results/pairs/encore/grit-mixed-1.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: k6/bench.js
        output: -

     scenarios: (100.00%) 1 scenario, 50 max VUs, 40s max duration (incl. graceful stop):
              * mixed: 50 looping VUs for 30s (exec: mixed, gracefulStop: 10s)


running (01.0s), 50/50 VUs, 360 complete and 0 interrupted iterations
mixed   [   3% ] 50 VUs  01.0s/30s

running (02.0s), 50/50 VUs, 762 complete and 0 interrupted iterations
mixed   [   7% ] 50 VUs  02.0s/30s

running (03.0s), 50/50 VUs, 1189 complete and 0 interrupted iterations
mixed   [  10% ] 50 VUs  03.0s/30s

running (04.0s), 50/50 VUs, 1619 complete and 0 interrupted iterations
mixed   [  13% ] 50 VUs  04.0s/30s

running (05.0s), 50/50 VUs, 2174 complete and 0 interrupted iterations
mixed   [  17% ] 50 VUs  05.0s/30s

running (06.0s), 50/50 VUs, 2756 complete and 0 interrupted iterations
mixed   [  20% ] 50 VUs  06.0s/30s

running (07.0s), 50/50 VUs, 3445 complete and 0 interrupted iterations
mixed   [  23% ] 50 VUs  07.0s/30s

running (08.0s), 50/50 VUs, 4083 complete and 0 interrupted iterations
mixed   [  27% ] 50 VUs  08.0s/30s

running (09.0s), 50/50 VUs, 4727 complete and 0 interrupted iterations
mixed   [  30% ] 50 VUs  09.0s/30s

running (10.0s), 50/50 VUs, 5377 complete and 0 interrupted iterations
mixed   [  33% ] 50 VUs  10.0s/30s

running (11.0s), 50/50 VUs, 6097 complete and 0 interrupted iterations
mixed   [  37% ] 50 VUs  11.0s/30s

running (12.0s), 50/50 VUs, 6602 complete and 0 interrupted iterations
mixed   [  40% ] 50 VUs  12.0s/30s

running (13.0s), 50/50 VUs, 7144 complete and 0 interrupted iterations
mixed   [  43% ] 50 VUs  13.0s/30s

running (14.0s), 50/50 VUs, 7740 complete and 0 interrupted iterations
mixed   [  47% ] 50 VUs  14.0s/30s

running (15.0s), 50/50 VUs, 8322 complete and 0 interrupted iterations
mixed   [  50% ] 50 VUs  15.0s/30s

running (16.0s), 50/50 VUs, 9020 complete and 0 interrupted iterations
mixed   [  53% ] 50 VUs  16.0s/30s

running (17.0s), 50/50 VUs, 9576 complete and 0 interrupted iterations
mixed   [  57% ] 50 VUs  17.0s/30s

running (18.0s), 50/50 VUs, 10224 complete and 0 interrupted iterations
mixed   [  60% ] 50 VUs  18.0s/30s

running (19.0s), 50/50 VUs, 10855 complete and 0 interrupted iterations
mixed   [  63% ] 50 VUs  19.0s/30s

running (20.0s), 50/50 VUs, 11364 complete and 0 interrupted iterations
mixed   [  67% ] 50 VUs  20.0s/30s

running (21.0s), 50/50 VUs, 11923 complete and 0 interrupted iterations
mixed   [  70% ] 50 VUs  21.0s/30s

running (22.0s), 50/50 VUs, 12460 complete and 0 interrupted iterations
mixed   [  73% ] 50 VUs  22.0s/30s

running (23.0s), 50/50 VUs, 13044 complete and 0 interrupted iterations
mixed   [  77% ] 50 VUs  23.0s/30s

running (24.0s), 50/50 VUs, 13667 complete and 0 interrupted iterations
mixed   [  80% ] 50 VUs  24.0s/30s

running (25.0s), 50/50 VUs, 14255 complete and 0 interrupted iterations
mixed   [  83% ] 50 VUs  25.0s/30s

running (26.0s), 50/50 VUs, 14884 complete and 0 interrupted iterations
mixed   [  87% ] 50 VUs  26.0s/30s

running (27.0s), 50/50 VUs, 15435 complete and 0 interrupted iterations
mixed   [  90% ] 50 VUs  27.0s/30s

running (28.0s), 50/50 VUs, 16007 complete and 0 interrupted iterations
mixed   [  93% ] 50 VUs  28.0s/30s

running (29.0s), 50/50 VUs, 16562 complete and 0 interrupted iterations
mixed   [  97% ] 50 VUs  29.0s/30s

running (30.0s), 50/50 VUs, 16938 complete and 0 interrupted iterations
mixed   [ 100% ] 50 VUs  30.0s/30s


  █ THRESHOLDS 

    failed_requests
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 33986   1130.482586/s
    checks_succeeded...: 100.00% 33986 out of 33986
    checks_failed......: 0.00%   0 out of 33986

    ✓ status ok
    ✓ has data

    CUSTOM
    failed_requests................: 0.00%  0 out of 16993
    ttfb...........................: avg=85.26ms min=864.12µs med=71.83ms max=480.32ms p(90)=161.52ms p(95)=199.59ms

    HTTP
    http_req_duration..............: avg=87.27ms min=992.56µs med=74.04ms max=521.53ms p(90)=165.14ms p(95)=201.84ms
      { expected_response:true }...: avg=87.27ms min=992.56µs med=74.04ms max=521.53ms p(90)=165.14ms p(95)=201.84ms
    http_req_failed................: 0.00%  0 out of 16993
    http_reqs......................: 16993  565.241293/s

    EXECUTION
    iteration_duration.............: avg=88.29ms min=1.25ms   med=75.04ms max=521.8ms  p(90)=166.25ms p(95)=203.26ms
    iterations.....................: 16993  565.241293/s
    vus............................: 50     min=50         max=50
    vus_max........................: 50     min=50         max=50

    NETWORK
    data_received..................: 104 MB 3.5 MB/s
    data_sent......................: 2.8 MB 95 kB/s



running (30.1s), 00/50 VUs, 16993 complete and 0 interrupted iterations
mixed ✓ [ 100% ] 50 VUs  30s